app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])
    @user = User.find_by(id:@post.user_id)

INSERT INTO "posts" ("image", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image", "#<ActionDispatch::Http::UploadedFile:0x00007f81fc6d8258>"], ["body", "hello"], ["user_id", 2], ["created_at", "2021-11-16 15:55:59.558773"], ["updated_at", "2021-11-16 15:55:59.558773"]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", "42443960_333799077177725_2045963690708041728_n.jpg"], ["updated_at", "2021-11-16 16:31:10.404045"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.user_id = current_user.id

    if @post.update(post_params)